input = list(input())
state = 'q1'
index = 0



mem_tape = [0]*(len(input)+1)

k = 0
mem_tape[0] = " "
# без этой обработки не работает.
for k in range(1,len(input)+1):
    mem_tape[k] = input[k-1]

algorithm = {
            'q1': {'0': ['0', 1, 'q1'],
                '1': ['1', 1, 'q1'],
                '2': ['2', 1, 'q1'],
                '+': ['+', 1, 'q2'],
                '-': ['-', 1, 'q5'],
                ' ': [' ', 1, 'q1']},

         'q2': {'0': ['0', 0, 'STOP'],
                '1': ['1', -1, 'q3'],
                '2': ['2', -1, 'q4']},

         'q3': {'0': ['1', 0, 'STOP'],
                '1': ['2', 0, 'STOP'],
                '2': ['0', -1, 'q3'],
                '+': ['+', -1, 'q3'],
                ' ': ['1', 0, 'STOP']},

         'q4': {'0': ['2', 0, 'STOP'],
                '1': ['0', -1, 'q3'],
                '2': ['1', -1, 'q3'],
                '+': ['+', -1, 'q4']},

         'q5': {'0': ['0', 0, 'STOP'],
                '1': ['1', -1, 'q6'],
                '2': ['2', -1, 'q7']},

         'q6': {'0': ['2', -1, 'q6'],
                '1': ['0', 0, 'q8'],
                '2': ['1', 0, 'q8'],
                '-': ['-', -1, 'q6']},

         'q7': {'0': ['1', -1, 'q6'],
                '1': ['2', -1, 'q6'],
                '2': ['0', 0, 'q8'],
                '-': ['-', -1, 'q7']},

         'q8': {'0': ['0', -1, 'q8'],
                '1': ['1', -1, 'q8'],
                '2': ['2', -1, 'q8'],
                '+': ['+', -1, 'q8'],
                '-': ['-', -1, 'q8'],
                ' ': [' ', 0, 'q9']},

         'q9': {'0': ['0', 1, 'q9'],
                '1': ['1', -1, 'q10'],
                '2': ['2', -1, 'q10'],
                '+': ['+', -1, 'STOP'],
                '-': ['-', -1, 'STOP'],
                ' ': [' ', 1, 'q9']},

         'q10': {'0': [' ', 0, 'STOP'],
                 ' ': [' ', 0, 'STOP']}
            }

while state != "STOP":
    data = algorithm[state][mem_tape[index]]
    mem_tape[index] = data[0]
    index += int(data[1])
    state = data[2]
l = 1


# Исправление вывода. (Возможно программа не проходила проверку из-за лишнего пробела при вычитании из больших чисел 10000-2)

for k in range(1,len(mem_tape)):
	if (mem_tape[k] != ' '):
		print(mem_tape[k], end='')